# LASI 2021 Machine Learning Workshop

##  Grammar of Data Manipulation, based on R's dplyr
##  Pandas dataframe
Instructors: Alfred Essa, Lalitha Agnihotri

Our approach in this section will be to use, ironically enough, R as a starting point. If you are familiar with R, dplyr is a ``grammar`` of data manipulation, providing a consistent set of verbs that help you solve the most common data manipulation challenges. The dplyr transformations on a dataframe are:

- **mutate** adds new variables that are functions of existing variables
- **select** picks variables based on their names.
- **filter** picks cases based on their values.
- **summarise** reduces multiple values down to a single summary.
- **arrange** changes the ordering of the rows.

Our starting point is a dataframe and operations on the dataframe. 

We need to note that a Python dataframe is similar but not the same as an R dataframe. It is the same in the sense that a dataframe has a tabular structure, containing rows and columns. It is not the same in the sense that in Python rows and columns can have labels.

In [1]:
# import libraries
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

### 2.21 Load Data

In [2]:
# we are loading a csv file and creating a dataframe
df = pd.read_csv("data/StudentsPerformance.csv")

In [3]:
# examining the first five records
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
### Basic Information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [5]:
df.shape

(1000, 8)

### Select - Subset of Columns

In [6]:
# select a single column
male = df[df['gender']=='male']
female = df[df['gender']=='female']

In [7]:
print(male.shape)
print(female.shape)

(482, 8)
(518, 8)

In [8]:
# created new dataframe with selected columns
scores = df[['gender','math score','reading score','writing score']]

In [9]:
scores.head()

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75

### Filter  - subset using some condition

In [10]:
# females whose score in math was greater than 70
new_df = df[(df['gender']=='female') & (df["math score"]>=70)]

In [11]:
df.iloc[0:5,2:5]

  parental level of education         lunch test preparation course
0           bachelor's degree      standard                    none
1                some college      standard               completed
2             master's degree      standard                    none
3          associate's degree  free/reduced                    none
4                some college      standard                    none

In [13]:
new_df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
36,female,group D,associate's degree,standard,none,74,81,83

In [14]:
new_df = df[(df['gender']=='female') & (df["math score"]>=70)][["math score","reading score", "writing score"]]

### Arrange - sort by some column

In [15]:
# ten lowest math scores
df.sort_values(by="math score").head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,female,group C,some high school,free/reduced,none,0,17,10
980,female,group B,high school,free/reduced,none,8,24,23
17,female,group B,some high school,free/reduced,none,18,32,28
787,female,group B,some college,standard,none,19,38,32
145,female,group C,some college,free/reduced,none,22,39,33
842,female,group B,high school,free/reduced,completed,23,44,36
338,female,group B,some high school,free/reduced,none,24,38,27
466,female,group D,associate's degree,free/reduced,none,26,31,38
91,male,group C,high school,free/reduced,none,27,34,36
363,female,group D,some high school,free/reduced,none,27,34,32

In [16]:
# ten heaviest math scores
df.sort_values(by="math score", ascending=False).head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
962,female,group E,associate's degree,standard,none,100,100,100
625,male,group D,some college,standard,completed,100,97,99
458,female,group E,bachelor's degree,standard,none,100,100,100
623,male,group A,some college,standard,completed,100,96,86
451,female,group E,some college,standard,none,100,92,97
149,male,group E,associate's degree,free/reduced,completed,100,100,93
916,male,group E,bachelor's degree,standard,completed,100,100,100
263,female,group E,high school,standard,none,99,93,90
306,male,group E,some college,standard,completed,99,87,81
114,female,group E,bachelor's degree,standard,completed,99,100,100

### 2.25 Mutate - add column

In [17]:
# create a new column weight/mpg
df['average score'] = (df['math score']+ df['reading score'] + df['writing score'])/3

In [18]:
df['average score'] = df['average score'].apply(int)

In [19]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average score
0,female,group B,bachelor's degree,standard,none,72,72,74,72
1,female,group C,some college,standard,completed,69,90,88,82
2,female,group B,master's degree,standard,none,90,95,93,92
3,male,group A,associate's degree,free/reduced,none,47,57,44,49
4,male,group C,some college,standard,none,76,78,75,76

### 2.26 Summarise

In [20]:
df.mean()

math score       66.089
reading score    69.169
writing score    68.054
average score    67.445
dtype: float64

In [21]:
df.std()

math score       15.163080
reading score    14.600192
writing score    15.195657
average score    14.263324
dtype: float64

In [22]:
# group dataframe by origin
grp_gender = df.groupby('gender')

In [23]:
grp_gender.mean()

        math score  reading score  writing score  average score
gender
female   63.633205      72.608108      72.467181      69.239382
male     68.728216      65.473029      63.311203      65.516598